trunk/soppa/soppa_rails/app/controllers/ingredient_types_controller.rb

  def index
    @ingredient_types = IngredientType.all
---
SELECT * FROM "ingredient_types"

  def show
    @ingredient_type = IngredientType.find(params[:id])
---
SELECT * FROM "ingredient_types" WHERE ("ingredient_types"."id" = 1)

  def create
    @ingredient_type = IngredientType.new(params[:ingredient_type])

    respond_to do |format|
      if @ingredient_type.save
---
INSERT INTO "ingredient_types" ("name", "created_at", "updated_at", "description") VALUES('Tipo de ingrediente 1', '2009-10-19 13:55:06', '2009-10-19 13:55:06', 'Tipo de ingrediente 1')