trunk/soppa/soppa_rails/app/controllers/ingredients_controller.rb

  def index
    @ingredients = Ingredient.all
---
SELECT * FROM "ingredients"

  def show
    @ingredient = Ingredient.find(params[:id])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)

  def create
    @ingredient = Ingredient.new(params[:ingredient])

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("name", "ingredient_type_id", "created_at", "updated_at", "description") VALUES('Tomate', 2, '2009-10-19 14:17:43', '2009-10-19 14:17:43', 'Tomates verdes fritos')

  def update
    @ingredient = Ingredient.find(params[:id])

    respond_to do |format|
      if @ingredient.update_attributes(params[:ingredient])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)
UPDATE "ingredients" SET "updated_at" = '2009-10-19 14:23:28', "ingredient_type_id" = 1 WHERE "id" = 1