trunk/soppa/soppa_rails/app/controllers/recipe_types_controller.rb

  def index
    @recipe_types = RecipeType.all
---
SELECT * FROM "recipe_types"

  def show
    @recipe_type = RecipeType.find(params[:id])
---
SELECT * FROM "recipe_types" WHERE ("recipe_types"."id" = 1)

  def edit
    @recipe_type = RecipeType.find(params[:id])
---
SELECT * FROM "recipe_types" WHERE ("recipe_types"."id" = 1)

  def create
    @recipe_type = RecipeType.new(params[:recipe_type])

    respond_to do |format|
      if @recipe_type.save
---
INSERT INTO "recipe_types" ("name", "created_at", "updated_at", "description") VALUES('Massa', '2009-10-15 20:16:44', '2009-10-15 20:16:44', 'Massas como pizza, lasanha, raviolli e etc.')