trunk/soppa/soppa_rails/app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM "recipes"