soppa/soppa_rails/app/controllers/profiles_controller.rb

SELECT * FROM "profiles" WHERE ("profiles".user_id = 2) LIMIT 1
---
  def index
    @profiles = Profile.all

SELECT * FROM "profiles" WHERE ("profiles".user_id = 2) LIMIT 1
---
  def show
    @profile = Profile.find(params[:id])

SELECT * FROM "profiles" WHERE ("profiles".user_id = 2) LIMIT 1
SELECT * FROM "cities" WHERE ("cities"."id" = 2)
---
  def edit
    profile = Profile.find(params[:id])
    @profile = profile if can_edit_profile? profile
    @profile = current_user.profile unless can_edit_profile? profile
    @cities = City.find(:all)

INSERT INTO "profiles" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "about", "user_id", "city_id") VALUES('dasdasdas', '2009-08-27 02:47:41', 77943, '2009-08-27 02:47:41', 'foto_41.jpg', 'image/jpeg', 'dasdasd', 6, 2)
---
  def create
    @profile = Profile.new(params[:profile])
    @profile.user = self.current_user

    respond_to do |format|
      if @profile.save

SELECT * FROM "profiles" WHERE ("profiles".user_id = 2) LIMIT 1
UPDATE "profiles" SET "updated_at" = '2009-08-26 21:22:43', "photo_file_name" = 'P1190748.JPG', "photo_file_size" = 19392, "photo_content_type" = 'image/jpeg' WHERE "id" = 1
---
  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])