soppa/soppa_rails/app/controllers/recipes_controller.rb

  def index

    @recipes = []
    @my_recipes = []

    Recipe.all.each do |recipe|
---
SELECT * FROM "recipes"

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def create
    @recipe = Recipe.new(params[:recipe])
    @recipe.user = current_user

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("name", "rendiment", "created_at", "updated_at", "prepare_time", "user_id", "description", "recipe_type_id", "prepare_mode", "score") VALUES('Receita teste 1', '5 porções', '2009-10-25 20:54:13', '2009-10-25 20:54:13', '2000-05-01 00:00:00', NULL, 'Receita de testes', 1, 'Prepara-se de algum jeito que eu não sei qual é!', NULL)

  def update
    @recipe = Recipe.find(params[:id])

    respond_to do |format|
      if @recipe.update_attributes(params[:recipe])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 2)
UPDATE "recipes" SET "updated_at" = '2009-10-25 21:05:49', "score" = 2 WHERE "id" = 2