soppa/soppa_rails/app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "identity_url", "email") VALUES('e6e72933ed7f4766591b73f286f0671446d93bba', '2009-08-23 02:03:20', '0f708ef36dc08fca0c50a32b7648b1c1498e5473', NULL, '2009-08-23 02:03:20', NULL, 'carla', NULL, 'carla@soppa.com.br')